
//_______________________________________________________________________
//| FILE:         lld_sdi_sta206x.h
//| PROJECT:
//| SW-COMPONENT: LLD
//|_______________________________________________________________________
//| DESCRIPTION:  SDI low level driver header file
//|_______________________________________________________________________
//| COPYRIGHT:    (c)STMicroelectronics,
//| HISTORY:
//| Date      | Modification               | Author
//|_______________________________________________________________________
//| 07.11.09  | Initial revision           |
//|_______________________________________________________________________
//| 09.07.14  |    |
//|           |                   |
//|_______________________________________________________________________

#ifndef _LLD_SDI_H_
#define _LLD_SDI_H_

//----------------------------------------------------------------------
// ---------------------------- MACRO ----------------------------------
//----------------------------------------------------------------------

#define READ_BIT(reg, bit)					(((tU32)reg) &  ((tU32)1  << (tU32)bit))
#define SET_BIT(Reg, Bit)					(((tU32)reg) |= (((tU32)1 << (tU32)bit)))

#define CLEAR_BITS(Reg,Bit)						((reg) &= ~(mask))

#define READ_BITFIELD(Reg,StartPos,EndPos)		(Reg<<(31-EndPos))>>(31-(EndPos-StartPos))	
#define WRITE_BITFIELD(StartPos,EndPos,Val,Reg)	Reg=(Val|(Reg& ~((0xFFFFFFFF<<(31-EndPos))>>(31-(EndPos-StartPos))<<StartPos)))


    SDI_GENERAL_UNKNOWN_ERROR           =19,           /* General or Unknown error */
    SDI_STREAM_READ_UNDERRUN            =20,           /* The card could not sustain data transfer in stream read operation. */
    SDI_STREAM_WRITE_OVERRUN            =21,           /* The card could not sustain data programming in stream mode */
    SDI_CID_CSD_OVERWRITE               =22,           /* CID/CSD overwrite error */
    SDI_WP_ERASE_SKIP                   =23,           /* only partial address space was erased */
    SDI_CARD_ECC_DISABLED               =24,           /* Command has been executed without using internal ECC */
    SDI_ERASE_RESET                     =25,           /* Erase sequence was cleared before executing because an out of erase sequence command was received */
    SDI_AKE_SEQ_ERROR                   =26,           /* Error in sequence of authentication. */
    SDI_INVALID_VOLTRANGE               =27,
    SDI_SEL_DESEL_STATUS_UNKNOW              =28,
    SDI_SWITCH_ERROR                    =29,
   
    //standard error defines 
    SDI_INTERNAL_ERROR                       =30,
    SDI_NOT_CONFIGURED                        =31,
    SDI_REQUEST_PENDING                      =32,
    SDI_REQUEST_NOT_APPLICABLE        =33,
    SDI_INVALID_PARAMETER                 =34,
    SDI_UNSUPPORTED_FEATURE             =35,
    SDI_UNSUPPORTED_HW                      =36,
    SDI_INTERNAL_EVENT                       =38,
    SDI_APP_CMD_ERROR                       =39,
    SDI_DATA_TRANSFER_ERROR =40,

    
    //global errors
   SDI_OK                              =0X00,
   SDI_ERROR                         =0xFF,

}SDI_ErrorTy;

typedef enum
{
      TAAC_TU_0      = 0,
      TAAC_TU_1     = 1,
      TAAC_TU_2   = 2,
      TAAC_TU_3       = 3,
      TAAC_TU_4     = 4,
      TAAC_TU_5   = 5,
      TAAC_TU_6       = 6,
      TAAC_TU_7     = 7

}TAAC_TimeUnitTy;

typedef enum
{
      TAAC_MUL_FACT_0       = 0,
      TAAC_MUL_FACT_1       = 1,
      TAAC_MUL_FACT_2       = 2,
      TAAC_MUL_FACT_3       = 3,
      TAAC_MUL_FACT_4       = 4,
      TAAC_MUL_FACT_5       = 5,
      TAAC_MUL_FACT_6       = 6,
      TAAC_MUL_FACT_7       = 7,
      TAAC_MUL_FACT_8       = 8,
      TAAC_MUL_FACT_9       = 9,
      TAAC_MUL_FACT_10     = 10,
      TAAC_MUL_FACT_11     = 11,
      TAAC_MUL_FACT_12     = 12,
      TAAC_MUL_FACT_13     = 13,
      TAAC_MUL_FACT_14     = 14,
      TAAC_MUL_FACT_15     = 15,
      TAAC_MUL_FACT_16     = 16

}TAAC_MultFactTy;


//----------------------------------------------------------------------
// ------------------------ STRUCT ------------------------------
//----------------------------------------------------------------------

//Card access mode: 
            //12.5 MB/sec interface speed (default)
            //25 MB/sec interface speed. (highspeed)
//Card command system:
            //Standard command set (default)
            // eCommerce command set 

typedef union 
{
	struct 
	{
            tU8		Card_Acc_Mode        :4; //[3:0] function group 1 for Card access mode
            tU8		Card_Cmd_Sys           :4;//[7:4] function group 2 for Card command system
            tU8		FG3_Dummy              :4;//[11:8] reserved for function group 3 (0h or Fh)
            tU8		FG4_Dummy              :4;//[15:12] reserved for function group 4 (0h or Fh)
            tU8		FG5_Dummy             :4;//[19:16] reserved for function group 5 (0h or Fh)
            tU8		FG6_Dummy              :4;//[23:20] reserved for function group 6 (0h or Fh)
            tU8		reserved                    :7;//[30:24] reserved (All ’0’)
            tU8		Mode                          :1;//[31] Mode, 0:Check function,1:Switch function
        }FIELDS;	
	tU32 	REG ;
}SDI_SD_SwitchTy;

typedef union 
{
	struct 
	{
		tU32		Cmd_Set:3;
		tU32		res1:5;
		tU32		Value:8;
		tU32		Reg_Byte_pt:8;
		tU32		Access_Mode:2;
		tU32		res2:6;
      
	}FIELDS;	
	tU32 	REG ;
}SDI_MMC_SwitchTy;


typedef struct
{
      CARD_CapacityTy		                     Capacity;			         
      CARD_VoltageRangeTy                    VoltRange;
      CARD_SpeedTy                                 Speed;
      CARD_CapacityTy                             Dummy_Type;
} SDI_CardTy;


typedef union // 32-BIT CARD STATUS REGISTER
{
	struct 
	{
		tU32		res_0_1_2:                      3;//bits 0,1,2
		tU32		Ake_Seq_Error:               1;//bit 3
		tU32		res_4:                              1;//bit4
		tU32		App_Cmd:                        1;//bit 5
              tU32		res_6_7:                          2;//bit 6,7
		//tU32		Switch_Error:                   1;//only MMC Card
		tU32		Ready_For_Data:             1;//bit 8
		tU32		Current_State:                 4;// bits 9,10,11,12
		tU32		Erase_Reset:                    1;//bit 13
		tU32		Card_ECC_Disabled:         1;//bit 14
		tU32		Wp_Erase_Skip:                1;//bit 15
		tU32		CSD_Overwrite:                1;//bit 16
		//tU32		Stream_Read_Underrun:  1;//only MMC Card
		//tU32		Stream_Write_Overrun:   1;//only MMC Card
              tU32		res_17_18:                       2;//bits 17, 18 
		tU32 	      General_Error:                  1;//bits 19
		tU32		CC_Error:                          1;//20
		tU32		Card_ECC_Fail:                 1;//21
		tU32		Illegal_Command:              1;//22
		tU32		Cmd_CRC_Error:                 1;//23
		tU32		Lock_Unlock_Fail:                 1;//24
		tU32		Card_Is_Locked:                  1;//25
		tU32 	      Wp_Violation:                    1;            //26
		tU32		Erase_Param_Error:           1;//27
		tU32		Erase_Seq_Error:                1;//28
		tU32		Block_Lenght_Error:          1;//29
		tU32		Address_Error:                   1;//30
		tU32		Cmd_Out_Of_Range:            1;//31
	}FIELDS;	

	tU32 	REG ;
}SDI_CARD_STATUS_Ty;


typedef union 
{
	struct 
	{
	 tU32   time_unit_msec;//
            tU32   time_unit;//
            float   mult_factor;
	}FIELDS;	
	tU32 	REG ;
}TAAC_Ty;


typedef struct
{  
   tU32   CSD_STRUCTURE;
   tU32 Nac;

      tU32   MMC_COMMAND_SET;
      tU32   MMC_SEC_COUNT;
      TAAC_Ty   TAAC;                   //
      tU32   NSAC;                   //
      tU32   TRAN_SPEED;       //value reads from CSD-->max clock frequency supported to card (hz)

} SDI_RegsFieldsTy;

typedef struct
{

      tU32                                            OCR;
      tU32      					               CID[4];
      tU32      					               CSD[4];
      tU32                                            *extCSD;//MMC only    
      tU32     					               RCA;
      
      SDI_CARD_STATUS_Ty              CardStatus;
